-- sigungu 시, 군, 구

INSERT INTO sigungu (sigungu_code, sigungu_name, sido_id) VALUES
-- 서울특별시 (sido_id=1)
('11110', '종로구', 1),
('11140', '중구', 1),
('11170', '용산구', 1),
('11200', '성동구', 1),
('11215', '광진구', 1),
('11230', '동대문구', 1),
('11260', '중랑구', 1),
('11290', '성북구', 1),
('11305', '강북구', 1),
('11320', '도봉구', 1),

-- 부산광역시 (sido_id=2)
('26110', '중구', 2),
('26140', '서구', 2),
('26170', '동구', 2),
('26200', '영도구', 2),
('26230', '부산진구', 2),

-- 대구광역시 (sido_id=3)
('27110', '중구', 3),
('27140', '동구', 3),
('27170', '서구', 3),

-- 인천광역시 (sido_id=4)
('28110', '중구', 4),
('28140', '동구', 4),
('28170', '남구', 4),

-- 광주광역시 (sido_id=5)
('29110', '동구', 5),

-- 대전광역시 (sido_id=6)
('30110', '동구', 6),

-- 울산광역시 (sido_id=7)
('31110', '중구', 7),

-- 경기도 (sido_id=8)
('41110', '수원시', 8),
('41111', '수원시 장안구', 8),
('41113', '수원시 권선구', 8),

-- 강원도 (sido_id=9)
('42110', '춘천시', 9),

-- 충청북도 (sido_id=10)
('43110', '청주시', 10);